MikroElektronika/core_packages/ARM/gcc_clang/def/gigadevice/GD32W515P0Q6/mcu.h
/*!
    \file    gd32w51x.h
    \brief   general definitions for GD32W51x
    
    \version 2025-01-23, V1.4.0, firmware for GD32W51x
*/

/*
 * Copyright (c) 2009-2018 Arm Limited. All rights reserved.
 * Copyright (c) 2025, GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* This file refers the CMSIS standard, some adjustments are made according to GigaDevice chips */

#ifndef GD32W51x_H
#define GD32W51x_H

#ifdef __cplusplus
 extern "C" {
#endif 

/* define value of high speed crystal oscillator (HXTAL) in Hz */
#if !defined  (HXTAL_VALUE)
#define HXTAL_VALUE    ((uint32_t)40000000)
#endif /* high speed crystal oscillator value */

/* define startup timeout value of high speed crystal oscillator (HXTAL) */
#if !defined  (HXTAL_STARTUP_TIMEOUT)
#define HXTAL_STARTUP_TIMEOUT   ((uint16_t)0xFFFFU)
#endif /* high speed crystal oscillator startup timeout */

/* define value of internal 16MHz RC oscillator (IRC16M) in Hz */
#if !defined  (IRC16M_VALUE) 
#define IRC16M_VALUE  ((uint32_t)16000000)
#endif /* internal 16MHz RC oscillator value */

/* define startup timeout value of internal 16MHz RC oscillator (IRC16M) */
#if !defined  (IRC16M_STARTUP_TIMEOUT)
#define IRC16M_STARTUP_TIMEOUT   ((uint16_t)0x0500U)
#endif /* internal 16MHz RC oscillator startup timeout */

/* define value of internal 32KHz RC oscillator(IRC32K) in Hz */
#if !defined  (IRC32K_VALUE) 
#define IRC32K_VALUE  ((uint32_t)32000)
#endif /* internal 32KHz RC oscillator value */

/* define value of low speed crystal oscillator (LXTAL)in Hz */
#if !defined  (LXTAL_VALUE) 
#define LXTAL_VALUE  ((uint32_t)32768)
#endif /* low speed crystal oscillator value */

/* GD32W51x firmware library version number */
#define __GD32W51X_STDPERIPH_VERSION_MAIN   (0x01) /*!< [31:24] main version */
#define __GD32W51X_STDPERIPH_VERSION_SUB1   (0x04) /*!< [23:16] sub1 version */
#define __GD32W51X_STDPERIPH_VERSION_SUB2   (0x00) /*!< [15:8]  sub2 version */
#define __GD32W51X_STDPERIPH_VERSION_RC     (0x00) /*!< [7:0]  release candidate */ 
#define __GD32W51X_STDPERIPH_VERSION        ((__GD32W51X_STDPERIPH_VERSION_MAIN << 24)\
                                            |(__GD32W51X_STDPERIPH_VERSION_SUB1 << 16)\
                                            |(__GD32W51X_STDPERIPH_VERSION_SUB2 << 8)\
                                            |(__GD32W51X_STDPERIPH_VERSION_RC))


/* Configuration of the Cortex-M33 Processor and Core Peripherals */
#define __CM33_REV                0x0000U   /*!< Core revision r0p1 */
#define __SAUREGION_PRESENT       1U        /*!< SAU regions present */
#define __MPU_PRESENT             1U        /*!< MPU present */
#define __VTOR_PRESENT            1U        /*!< VTOR present */
#define __NVIC_PRIO_BITS          4U        /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0U        /*!< Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT             1U        /*!< FPU present */
#define __DSP_PRESENT             1U        /*!< DSP extension present */
/* define interrupt number */
typedef enum IRQn
{
    /* Cortex-M33 processor exceptions numbers */
    Reset_IRQn                  = -15,    /*!< -15 Reset Vector, invoked on Power up and warm reset */
    NonMaskableInt_IRQn         = -14,    /*!< -14 Non maskable Interrupt, cannot be stopped or preempted */
    HardFault_IRQn              = -13,    /*!< -13 Hard Fault, all classes of Fault */
    MemoryManagement_IRQn       = -12,    /*!< -12 Memory Management, MPU mismatch, including Access Violation and No Match */
    BusFault_IRQn               = -11,    /*!< -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
    UsageFault_IRQn             = -10,    /*!< -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
    SecureFault_IRQn            =  -9,    /*!< -9  Secure Fault */
    SVCall_IRQn                 =  -5,    /*!< -5  System Service Call via SVC instruction */
    DebugMonitor_IRQn           =  -4,    /*!< -4  Debug Monitor */
    PendSV_IRQn                 =  -2,    /*!< -2  Pendable request for system service */
    SysTick_IRQn                =  -1,    /*!< -1  System Tick Timer */

    /* interruput numbers */              
    WWDGT_IRQn                  = 0,      /*!< window watchdog timer interrupt */
    LVD_IRQn                    = 1,      /*!< LVD through EXTI line detect interrupt */
    TAMPER_STAMP_IRQn           = 2,      /*!< tamper and timestamp through EXTI line detect */
    RTC_WKUP_IRQn               = 3,      /*!< RTC wakeup through EXTI line interrupt */
    FMC_IRQn                    = 4,      /*!< FMC interrupt */
    RCU_IRQn                    = 5,      /*!< RCU interrupt */
    EXTI0_IRQn                  = 6,      /*!< EXTI line 0 interrupts */
    EXTI1_IRQn                  = 7,      /*!< EXTI line 1 interrupts */
    EXTI2_IRQn                  = 8,      /*!< EXTI line 2 interrupts */
    EXTI3_IRQn                  = 9,      /*!< EXTI line 3 interrupts */
    EXTI4_IRQn                  = 10,     /*!< EXTI line 4 interrupts */
    DMA0_Channel0_IRQn          = 11,     /*!< DMA0 channel0 Interrupt */
    DMA0_Channel1_IRQn          = 12,     /*!< DMA0 channel1 Interrupt */
    DMA0_Channel2_IRQn          = 13,     /*!< DMA0 channel2 interrupt */
    DMA0_Channel3_IRQn          = 14,     /*!< DMA0 channel3 interrupt */
    DMA0_Channel4_IRQn          = 15,     /*!< DMA0 channel4 interrupt */
    DMA0_Channel5_IRQn          = 16,     /*!< DMA0 channel5 interrupt */
    DMA0_Channel6_IRQn          = 17,     /*!< DMA0 channel6 interrupt */
    DMA0_Channel7_IRQn          = 18,     /*!< DMA0 channel7 interrupt */
    ADC_IRQn                    = 19,     /*!< ADC interrupt */
    TAMPER_STAMP_S_IRQn         = 20,     /*!< RTC tamper and TimeStamp events security interrupt*/
    RTC_WKUP_S_IRQn             = 21,     /*!< RTC wakeup security interrupt*/
    RTC_Alarm_S_IRQn            = 22,     /*!< RTC Alarm security interrupt */
    EXTI5_9_IRQn                = 23,     /*!< EXTI[9:5] interrupts */
    TIMER0_BRK_IRQn             = 24,     /*!< TIMER0 break interrupts */
    TIMER0_UP_IRQn              = 25,     /*!< TIMER0 update interrupts */
    TIMER0_CMT_IRQn             = 26,     /*!< TIMER0 commutation interrupts */
    TIMER0_Channel_IRQn         = 27,     /*!< TIMER0 channel capture compare interrupt */
    TIMER1_IRQn                 = 28,     /*!< TIMER1 interrupt */
    TIMER2_IRQn                 = 29,     /*!< TIMER2 interrupt */
    TIMER3_IRQn                 = 30,     /*!< TIMER3 interrupts */
    I2C0_EV_IRQn                = 31,     /*!< I2C0 event interrupt */
    I2C0_ER_IRQn                = 32,     /*!< I2C0 error interrupt */
    I2C1_EV_IRQn                = 33,     /*!< I2C1 event interrupt */
    I2C1_ER_IRQn                = 34,     /*!< I2C1 error interrupt */
    SPI0_IRQn                   = 35,     /*!< SPI0 interrupt */
    SPI1_IRQn                   = 36,     /*!< SPI1 and I2S1 interrupt */
    USART0_IRQn                 = 37,     /*!< USART0 interrupt */
    USART1_IRQn                 = 38,     /*!< USART1 interrupt */
    USART2_IRQn                 = 39,     /*!< USART2 interrupt */
    EXTI10_15_IRQn              = 40,     /*!< EXTI[15:10] interrupts */
    RTC_Alarm_IRQn              = 41,     /*!< RTC alarm interrupt */
    VLVDF_IRQn                  = 42,     /*!< VLVDF interrupts */
    TIMER15_IRQn                = 44,     /*!< TIMER15 global interrupt */
    TIMER16_IRQn                = 45,     /*!< TIMER16 global interrupt */
    SDIO_IRQn                   = 49,     /*!< SDIO global interrupt */
    TIMER4_IRQn                 = 50,     /*!< TIMER4 global interrupt */
    I2C0_WKUP_IRQn              = 51,     /*!< I2C0 Wakeup interrupt*/ 
    USART0_WKUP_IRQn            = 52,     /*!< USART0 Wakeup */
    USART2_WKUP_IRQn            = 53,     /*!< USART2 Wakeup */
    TIMER5_IRQn                 = 54,     /*!< TIMER5 global interrupt */ 
    DMA1_Channel0_IRQn          = 56,     /*!< DMA1 channel0 interrupt */
    DMA1_Channel1_IRQn          = 57,     /*!< DMA1 channel1 interrupt */
    DMA1_Channel2_IRQn          = 58,     /*!< DMA1 channel2 interrupt */
    DMA1_Channel3_IRQn          = 59,     /*!< DMA1 channel3 interrupt */
    DMA1_Channel4_IRQn          = 60,     /*!< DMA1 channel4 interrupt */
    DMA1_Channel5_IRQn          = 61,     /*!< DMA1 channel5 interrupt */
    DMA1_Channel6_IRQn          = 62,     /*!< DMA1 channel6 interrupt */
    DMA1_Channel7_IRQn          = 63,     /*!< DMA1 channel7 interrupt */
    WIFI11N_WKUP_IRQn           = 66,     /*!< WIFI11N wakeup */
    USBFS_IRQn                  = 67,     /*!< USBFS interrupt */
    USBFS_WKUP_IRQn             = 76,     /*!< USBFS wakeup through EXTI line interrupt */
    CAU_IRQn                    = 79,     /*!< CAU interrupt */
    HAU_TRNG_IRQn               = 80,     /*!< HAU and TRNG interrupt */
    FPU_IRQn                    = 81,     /*!< FPU interrupt */
    WIFI11N_INT0_IRQn           = 91,     /*!< WIFI11N global interrupt0 */
    WIFI11N_INT1_IRQn           = 92,     /*!< WIFI11N global interrupt1 */
    WIFI11N_INT2_IRQn           = 93,     /*!< WIFI11N global interrupt2 */
    EFUSE_IRQn                  = 94,     /*!< EFUSE global interrupt */
    QSPI_IRQn                   = 95,     /*!< QSPI global interrupt */
    PKCAU_IRQn                  = 96,     /*!< PKCAU global interrupt */
    TSI_IRQn                    = 97,     /*!< TSI global interrupt */
    ICACHE_IRQn                 = 98,     /*!< ICACHE global interrupt */
    TZIAC_S_IRQn                = 99,     /*!< TrustZone Interrupt Controller secure interrupts */
    FMC_S_IRQn                  = 100,    /*!< FMC secure interrupt */
    QSPI_S_IRQn                = 101,     /*!< QSPI security interrupt */

