MikroElektronika/core_packages/ARM/gcc_clang/def/gigadevice/GD32W515P0Q6/mcu.h
#if defined (GD32W515PI) || defined (GD32W515P0)
    DCI_IRQn                    = 78,     /*!< DCI interrupt */
    HPDF_INT0_IRQn              = 89,     /*!< HPDF global Interrupt 0 */
    HPDF_INT1_IRQn              = 90,     /*!< HPDF global Interrupt 1 */
#endif /* GD32W515PI and GD32W515P0 */
} IRQn_Type;

/* includes */
// #include "core_cm33.h"  // Note: Changed for MikroE implementation.
// #include "system_gd32w51x.h"  // Note: Changed for MikroE implementation.
#include <stdint.h>

/* enum definitions */
typedef enum {DISABLE = 0, ENABLE = !DISABLE} EventStatus, ControlStatus;
typedef enum {RESET = 0, SET = !RESET} FlagStatus;
typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrStatus;

/* bit operations */
#define REG32(addr)                  (*(volatile uint32_t *)(uint32_t)(addr))
#define REG16(addr)                  (*(volatile uint16_t *)(uint32_t)(addr))
#define REG8(addr)                   (*(volatile uint8_t *)(uint32_t)(addr))
#define BIT(x)                       ((uint32_t)((uint32_t)0x00000001U<<(x)))
#define BITS(start, end)             ((0xFFFFFFFFUL << (start)) & (0xFFFFFFFFUL >> (31U - (uint32_t)(end)))) 
#define GET_BITS(regval, start, end) (((regval) & BITS((start),(end))) >> (start))

/* main flash and SRAM memory map */
#define FLASH_BASE_NS            ((uint32_t)0x08000000U)           /*!< main FLASH base address */
#define SRAM_BASE_NS             ((uint32_t)0x20000000U)           /*!< SRAM base address */
#define SRAM0_BASE_NS            ((uint32_t)0x20000000U)           /*!< SRAM0 base address */
#define SRAM1_BASE_NS            ((uint32_t)0x20010000U)           /*!< SRAM1 base address */
#define SRAM2_BASE_NS            ((uint32_t)0x20020000U)           /*!< SRAM2 base address */
#define SRAM3_BASE_NS            ((uint32_t)0x20040000U)           /*!< SRAM3 base address */

/* peripheral memory map */                                       
#define APB1_BUS_BASE_NS         ((uint32_t)0x40000000U)           /*!< apb1 base address */
#define APB2_BUS_BASE_NS         ((uint32_t)0x40010000U)           /*!< apb2 base address */
#define AHB1_BUS_BASE_NS         ((uint32_t)0x40020000U)           /*!< ahb1 base address */
#define AHB2_BUS_BASE_NS         ((uint32_t)0x4C000000U)           /*!< ahb2 base address */

/* SQPI_PSRAM memory map */                                       
#define SQPI_PSRAM               ((uint32_t)0x60000000U)           /*!< SQPI_PSRAM memory map base address */
/* QSPI_FLASH memory map */                                       
#define QSPI_FLASH               ((uint32_t)0x90000000U)           /*!< QSPI_FLASH base address */
/* advanced peripheral bus 1 memory map */
#define TIMER_BASE_NS            (APB1_BUS_BASE_NS + 0x00000000U)  /*!< TIMER base address */
#define RTC_BASE_NS              (APB1_BUS_BASE_NS + 0x00002800U)  /*!< RTC base address */
#define WWDGT_BASE_NS            (APB1_BUS_BASE_NS + 0x00002C00U)  /*!< WWDGT base address */
#define FWDGT_BASE_NS            (APB1_BUS_BASE_NS + 0x00003000U)  /*!< FWDGT base address */
#define I2S_ADD_BASE_NS          (APB1_BUS_BASE_NS + 0x00003400U)  /*!< I2S_add base address */
#define SPI_BASE_NS              (APB1_BUS_BASE_NS + 0x00003800U)  /*!< SPI base address */
#define USART_BASE_NS            (APB1_BUS_BASE_NS + 0x00004400U)  /*!< USART base address */
#define I2C_BASE_NS              (APB1_BUS_BASE_NS + 0x00005400U)  /*!< I2C base address */
#define PMU_BASE_NS              (APB1_BUS_BASE_NS + 0x00007000U)  /*!< PMU base address */

/* advanced peripheral bus 2 memory map */
#define ADC_BASE_NS              (APB2_BUS_BASE_NS + 0x00002000U)  /*!< ADC base address */
#define SDIO_BASE_NS             (APB2_BUS_BASE_NS + 0x00002C00U)  /*!< SDIO base address */
#define EXTI_BASE_NS             (APB2_BUS_BASE_NS + 0x00003C00U)  /*!< EXTI base address */
#define SYSCFG_BASE_NS           (APB2_BUS_BASE_NS + 0x00003800U)  /*!< SYSCFG base address */
#define HPDF_BASE_NS             (APB2_BUS_BASE_NS + 0x00006000U)  /*!< HPDF base address */
#define WIFI_RF_BASE_NS          (APB2_BUS_BASE_NS + 0x00007800U)  /*!< WIFI base address */

/* advanced high performance bus 1 memory map */
#define GPIO_BASE_NS             (AHB1_BUS_BASE_NS + 0x00000000U)  /*!< GPIO base address */
#define FMC_BASE_NS              (AHB1_BUS_BASE_NS + 0x00002000U)  /*!< FMC base address */
#define EFUSE_BASE_NS            (AHB1_BUS_BASE_NS + 0x00002800U)  /*!< EFUSE base address */
#define CRC_BASE_NS              (AHB1_BUS_BASE_NS + 0x00003000U)  /*!< CRC base address */
#define RCU_BASE_NS              (AHB1_BUS_BASE_NS + 0x00003800U)  /*!< RCU base address */
#define TSI_BASE_NS              (AHB1_BUS_BASE_NS + 0x00004000U)  /*!< TSI base address */
#define SQPI_REG_BASE_NS         (AHB1_BUS_BASE_NS + 0x00005400U)  /*!< SQPI base address */
#define QSPI_REG_BASE_NS         (AHB1_BUS_BASE_NS + 0x00005800U)  /*!< QSPI base address */
#define DMA_BASE_NS              (AHB1_BUS_BASE_NS + 0x00006000U)  /*!< DMA base address */
#define WIFI_BASE_NS             (AHB1_BUS_BASE_NS + 0x00010000U)  /*!< WIFI11N base address */
#define ICACHE_BASE_NS           (AHB1_BUS_BASE_NS + 0x00060000U)  /*!< ICACHE base address */
#define TZSPC_BASE_NS            (AHB1_BUS_BASE_NS + 0x00080000U)  /*!< TZSPC base address */
#define TZIAC_BASE_NS            (AHB1_BUS_BASE_NS + 0x00080400U)  /*!< TZIAC base address */
#define TZBMPC0_BASE_NS          (AHB1_BUS_BASE_NS + 0x00080800U)  /*!< TZBMPC0 base address */
#define TZBMPC1_BASE_NS          (AHB1_BUS_BASE_NS + 0x00080C00U)  /*!< TZBMPC1 base address */
#define TZBMPC2_BASE_NS          (AHB1_BUS_BASE_NS + 0x00090000U)  /*!< TZBMPC2 base address */
#define TZBMPC3_BASE_NS          (AHB1_BUS_BASE_NS + 0x00090400U)  /*!< TZBMPC3 base address */
#define USBFS_BASE_NS            (AHB1_BUS_BASE_NS + 0x08FE0000U)  /*!< USBFS base address */

/* advanced high performance bus 2 memory map */
#define DCI_BASE_NS              (AHB2_BUS_BASE_NS + 0x00050000U)  /*!< DCI base address */
#define CAU_BASE_NS              (AHB2_BUS_BASE_NS + 0x00060000U)  /*!< CAU base address */
#define HAU_BASE_NS              (AHB2_BUS_BASE_NS + 0x00060400U)  /*!< HAU base address */
#define TRNG_BASE_NS             (AHB2_BUS_BASE_NS + 0x00060800U)  /*!< TRNG base address */
#define PKCAU_BASE_NS            (AHB2_BUS_BASE_NS + 0x00061000U)  /*!< PKCAU base address */

